#數字運算
#+,-,*,/,%
#// 整數除法  不取小數點後的數值
#/ 小數除法
#**次方運算
#開根號**後面用0.5
x=7**6 #7的6次方
print(x)
x=7**0.5 #7的開根號
print(x)
x=2+3 
print(x)
x=x+1 #變數中的數字加1
#又可寫作 x+=1 x-=1 x*=1 x/=1 x%=1 x**=1 x//=1 ...等
print(x)
#-------------------------------------------------------------
#字串運算
s="Hello\"o" #跳脫 用[\]跟外面["]的符號做區隔 會印出(Hello"o)
print(s)
s= "Hello\nWorld" # \n可換行
print(s)
#前後三個單引號或者是雙引號之間都可以任意換行
s="""Hello  
World"""
print(s)
s='''Hello

World'''
print(s)
s="Hello "*3+"world" #字串可以用[*]去做重複堆疊
print(s)
#字串會對內部"字元"編號(索引)，從0開始算起
s="hello" #0,1,2,3,4
print(s[1:4]) #包含開頭編號不包含結尾，得到ell
print(s[:4]) #hell 不包含開頭，只取結尾
print(s[1:]) #ello 不給開頭只給結尾