import numpy as np
#切割一維陣列的值 書本 8-20
a = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9])
#             0  1  2  3  4  5  6  7  8
print("a=" + str(a))

b = a[1:3]     # 索引 1,2
print("a[1:3]=" + str(b))
b = a[:4]      # 索引 0,1,2,3
print("a[:4]=" + str(b))
b = a[3:]      # 索引 3,4,5,6,7,8
print("a[3:]=" + str(b))
b = a[2:9:3]   # 索引 2,5,8   #2到 9之間間隔 3個數  "資料組名稱[索引起始值:索引結束值:索引值改變量]"" 不包含寫入值
print("a[2:9:3]=" + str(b))
b = a[::2]     # 索引 0,2,4,6,8 間隔2位數
print("a[::2]=" + str(b))
b = a[::-1]    # 索引 8,7,6,5,4,3,2,1,0  從最後一位數開始索引 每次間隔 1 位數
print("a[::-1]=" + str(b))
b = a[2:-2]    # 索引 8,7,6,5,4,3,2,1,0  索引 2 到 -2 的值
print("a[2:-2]=" + str(b))  